1.Series

In [97]:
import pandas as pd
import numpy as np

- 시리즈 생성
    - numpy 1차원 어레이 + index

In [4]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
                index = ["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [5]:
type(s)

pandas.core.series.Series

In [98]:
# 인덱스를 별도로 설정하지 않으면, 인덱스는 0, 1, 2, ...이 된다.
pd.Series(np.arange(10, 15))

0    10
1    11
2    12
3    13
4    14
dtype: int32

In [8]:
s.index, type(s.index)

(Index(['서울', '부산', '인천', '대구'], dtype='object'),
 pandas.core.indexes.base.Index)

In [9]:

s.values, type(s.values)

(array([9904312, 3448737, 2890451, 2466052], dtype=int64), numpy.ndarray)

In [11]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

- 연산(Operation)

In [14]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

- 인덱싱

In [16]:
s['부산'], s[1]

(3448737, 3448737)

In [17]:
s['대구'], s[3], s[-1]

(2466052, 2466052, 2466052)

In [19]:
s[[0,1]]            # 결과는 Series

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [20]:
s[['서울', '부산']]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [21]:
s[(s > 2500000) & (s < 5000000)]        # 250만 초과 500만 미만

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- 슬라이싱

In [23]:
# 숫자 인덱스로 하는 슬라이싱은 넘파이와 동일
s[:2]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [24]:
# 인덱스 문자열로 하는 경우에는 : 뒤 인덱스를 포함
s['서울':'인천']

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- 인덱싱

In [25]:
s['부산'],s[1], s.부산  # 결과는 scalar

(3448737, 3448737, 3448737)

In [26]:
s['대구'], s[3], s[-1], s.대구

(2466052, 2466052, 2466052, 2466052)

In [27]:
s[[0,1]]            # 결과는 series

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [28]:
s['서울':'인천']

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- 시리즈와 딕셔너리

In [30]:
'서울' in s

True

In [31]:
for k, v in s.items():
    print(f'{k}: {v}')

서울: 9904312
부산: 3448737
인천: 2890451
대구: 2466052

In [32]:
d = {"서울" : 9631482, "부산": 3393191, "인천":2632035, "대전": 1490158}
s2 = pd.Series(d)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

- 인덱스 기반 연산

In [34]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [35]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [36]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [37]:
rs = (s - s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

- 데이터의 갱신, 삭제

In [39]:
rs['부산'] = 1.64
rs[1] = 2.83
rs.인천 = 9.82
rs

부산    1.64
서울    2.83
인천    9.82
dtype: float64

In [41]:
del rs['인천']
rs

부산    1.64
서울    2.83
dtype: float64

In [42]:
ser1 = pd.Series([2022, 2023], index = ["30000","350000"])
ser2 = pd.Series([1996,1997], index = ["20000","201000"])
ser1, ser2

(30000     2022
 350000    2023
 dtype: int64,
 20000     1996
 201000    1997
 dtype: int64)

In [45]:
import numpy as np

- 중요한 method

In [55]:
dice = pd.Series(np.random.randint(1,7, 10))
dice

0    3
1    1
2    3
3    4
4    4
5    5
6    5
7    1
8    2
9    6
dtype: int32

In [48]:
# element 의 갯수
dice.count()

10

In [56]:
# 고유한 값
dice.unique()

array([3, 1, 4, 5, 2, 6])

In [57]:
# 고유한 값의 갯수
dice.nunique()

6

In [59]:
# 고유한 값 별로 갯수
dice.value_counts()

3    2
1    2
4    2
5    2
2    1
6    1
Name: count, dtype: int64

In [60]:
np.unique(dice.values, return_counts= True)

(array([1, 2, 3, 4, 5, 6]), array([2, 1, 2, 2, 2, 1], dtype=int64))

In [62]:
dice.min(), dice.max(), dice.sum(), dice.mean()

(1, 6, 34, 3.4)

In [63]:
# 요약 기술 통계
dice.describe()

count    10.000000
mean      3.400000
std       1.712698
min       1.000000
25%       2.250000
50%       3.500000
75%       4.750000
max       6.000000
dtype: float64

In [64]:
# 데이터 기준 오름차순 
s.sort_values()

도시
대구    2466052
인천    2890451
부산    3448737
서울    9904312
Name: 인구, dtype: int64

In [65]:
# 데이터 기준 내림차순
s.sort_values(ascending=False)

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [66]:
# 인덱스 기준 오름차순
s.sort_index()

도시
대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [67]:
# 인덱스 기준 내림차순
s.sort_index(ascending=False)

도시
인천    2890451
서울    9904312
부산    3448737
대구    2466052
Name: 인구, dtype: int64

In [68]:
# inplace 옵션을 True로 하면 자기 파괴적 메소드가 됨.
s.sort_index(inplace=True)
s

도시
대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 인구, dtype: int64

- 결측치(Na, NaN, Null) 처리

In [70]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [71]:
ds.isna()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [72]:
ds.isnull()

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [73]:
ds.isna().sum()

2

In [75]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [76]:
survived = titanic['survived']
age = titanic['age']

In [81]:
survived.isna().sum()               # 결측치가 없음

0

In [84]:
age.isna().sum()                    # 결측치가 177개 있음

177

In [86]:
survived.count()                    # 결측치를 제외한 데이터 갯수

891

In [88]:
# 결측치를 제거
ds.dropna(inplace=True)
ds

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [90]:
ds = s -s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [91]:
# 결측치를 중앙값으로 대체
ds.fillna(ds.median())

대구    258416.0
대전    258416.0
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [93]:
# 결측치를 평균값으로 대체하고 ds를 변경
ds.fillna(ds.mean(),inplace = True)
ds

대구    195597.333333
대전    195597.333333
부산     55546.000000
서울    272830.000000
인천    258416.000000
dtype: float64

In [96]:
# 결측치를 0으로 설정하고, 데이터 타입을 정수형으로 변경
ds = s - s2
ds = ds.fillna(0).astype(int)
ds

대구         0
대전         0
부산     55546
서울    272830
인천    258416
dtype: int32